app/controllers/posts_controller.rb

  def create
    new_post = Post.create(content: params[:content], user_id: params[:user_id])
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This is my second post"], ["user_id", 1], ["created_at", "2023-06-07 20:59:35.948130"], ["updated_at", "2023-06-07 20:59:35.948130"]]

  def get
    get_posts = Post.all
---
SELECT "posts".* FROM "posts"