app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "janedoe"], ["email", "jane.doe@yahoo.com"], ["first_name", "Jane"], ["last_name", "Doe"], ["created_at", "2023-06-07 21:03:55.154854"], ["updated_at", "2023-06-07 21:03:55.154854"]]
---
  def create
    new_user = User.create(username: params[:username], email: params[:email], first_name: params[:first_name], last_name: params[:last_name])